#!/bin/bash

# Проверяем, передан ли комментарий к миграции
if [ -z "$1" ]
then
      echo "❌ Ошибка: Не указано описание миграции."
      echo "Использование: bash migrate.sh \"Описание изменений\""
      exit 1
fi

echo "🔄 Создание миграции..."
./venv_build/bin/alembic revision --autogenerate -m "$1"

if [ $? -eq 0 ]; then
    echo "✅ Миграция создана."
    
    echo "🔄 Применение миграции..."
    ./venv_build/bin/alembic upgrade head
    
    if [ $? -eq 0 ]; then
        echo "✅ База данных успешно обновлена!"
    else
        echo "❌ Ошибка при применении миграции."
        exit 1
    fi
else
    echo "❌ Ошибка при создании миграции."
    exit 1
fi
